Tekla Open API Reference for Tekla Structures 2025
AngleList Methods
Methods
Name | Description
Parse(String)
 Parses the given text as an angle list in the current unit type
Parse(String, IFormatProvider)
 Parses the given text as an angle list in the current unit type
Parse(String, IFormatProvider, Angle.UnitType)
 Parses the given text as an angle list in the current unit type
ToString(IEnumerable<Angle>)
 Converts the given angles to a string in the current units
ToString(IEnumerable<Angle>, Angle.UnitType)
 Converts the given angles to a string in the given units
ToString(IEnumerable<Angle>, String, IFormatProvider)
 Converts the given angles to a string with the given parameters in the current unit
ToString(IEnumerable<Angle>, String, IFormatProvider, Angle.UnitType)
 Converts the given angles to a string with the given parameters in the current unit
Top
See Also
Reference
AngleList Class
Tekla.Structures.Datatype Namespace